app/Tables/DocumentTable.php

    public function configure(SpladeTable $table)
    {


        $table
            ->withGlobalSearch(
                label: trans('tomato-admin::global.search'),
                columns: ['id','Number',]
            )
            ->bulkAction(
                label: trans('tomato-admin::global.crud.delete'),
                each: fn (\App\Models\Document $model) => $model->delete(),
---
delete from `documents` where `id` = 50