app/Http/Controllers/Admin/DocumentController.php

                    Log::info( $document['Number']);
                    // Realizar acciones con los atributos, como imprimirlos
                    try {
                    $documento->save();
---
update `documents` set `path_pdf` = 'archivos/96726670-1-33-1788551.pdf', `documents`.`updated_at` = '2024-03-14 05:55:46' where `id` = 9

    public function downloads_file(){
        Log::info('Vamos a llamar a todos.');
        $documents = Document::all();

        foreach ($documents as $document) {
            Log::info('Descargando PDF : '.  $document->Number);

     try {
                 $response = Http::get($document->UrlPdf);

                // Verificar si la solicitud fue exitosa
                if ($response->successful()) {
                    // Obtener el contenido del archivo
                    $contents = $response->body();

                    // Guardar el archivo en el directorio de almacenamiento de Laravel
                    //DocumentReceiverCode-DocumentTypeId-Number
                    $rutaArchivo = 'archivos/' . basename($document->DocumentReceiverCode.'-'.$document->DocumentTypeId.'-'.$document->Number) . '.pdf'; // Ruta donde se guardará el archivo
                    Storage::put($rutaArchivo, $contents);

                    $document->path_pdf=$rutaArchivo;
                    $document->save();
---
select * from `documents`
update `documents` set `path_pdf` = 'archivos/96726670-1-33-1788551.pdf', `documents`.`updated_at` = '2024-03-14 07:23:39' where `id` = 1