app/Http/Controllers/Admin/DocumentController.php

    public function index(Request $request): View
    {

        /*
        $documents = DB::table("Documents")->get();
---
select * from `Documents`